module.exports.config = {
  name: "goiadmin",
    version: "1.0.0",
    permission: 0,
    credits: "nayan",
    description: "mention",
    prefix: true,
    category: "user",
    usages: "tag",
    cooldowns: 5,
};
module.exports.handleEvent = function({ api, event }) {
  if (event.senderID !== "100092267315103") {
    var aid = ["100092267315103"];
    for (const id of aid) {
    if ( Object.keys(event.mentions) == id) {
      var msg = ["Mantion_দিস না তুষান বস এর মন মন ভালো নেই আস্কে-!💔🥀𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸", "- আমার সাথে কেউ সেক্স করে না থুক্কু টেক্স করে নাহ🫂💔-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸", "আমার একটা প্রিয়র খুব দরকার কারন আমার চোখে পানি আসার আগে নাকে সর্দি চলে আসে🤣🤣-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","এত মেনশন না দিয়ে বক্স আসো হট করে দিবো🤷‍ঝাং 😘🥒-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸"," Mantion_দিলে চুম্মাইয়া ঠুটের কালার change কইরা,লামু 💋😾😾🔨-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","এতু ইমুশানাল কথা বলো তল দেশ দিয়ে অজরে বৃষ্টি হচ্ছে আমার 😭😭-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","তুষান বস এখন  বিজি জা বলার আমাকে বলতে পারেন_!!😼🥰-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","এতো মিনশন নাহ দিয়া সিংগেল তুষান রে একটা জিএফ দে 😒 😏-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","Mantion_না দিয়ে সিরিয়াস প্রেম করতে চাইলে ইনবক্স-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","মেনশন দিসনা পারলে একটা জিএফ দে-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","Mantion_দিস না বাঁলপাঁক্না তুষান প্রচুর বিজি 🥵🥀🤐-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸","চুমু খাওয়ার বয়স টা  চকলেট🍫খেয়ে উড়িয়ে দিলাম🤗-𝐉𝐄𝐑𝐑𝐘-𝐁𝐎𝐓-💌   ᯽❄︎̶ͥᚐ ▸"];
      return api.sendMessage({body: msg[Math.floor(Math.random()*msg.length)]}, event.threadID, event.messageID);
    }
    }}
};
module.exports.run = async function({}) {
}
